server/app/controllers/categories_controller.rb

  def set_category!
    @category = Category.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]