server/app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "main_color", "accent_color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "kuper"], ["main_color", "#FFFFFF"], ["accent_color", "#AAAAAA"], ["created_at", "2024-10-03 21:29:37.727181"], ["updated_at", "2024-10-03 21:29:37.727181"]]

  def update
    @category = Category.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]