server/app/controllers/tasks_controller.rb

  def create
    @task = @desk.tasks.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("name", "body", "category_id", "status", "period", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    render json: { error: 'Некорректный id' }, status: :unprocessable_entity unless @task&.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]

  def set_task!
    @task = Task.find_by(id: params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]